; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :existential-preconditions :disjunctive-preconditions :conditional-effects)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
	carrier - locatable
	capacity_number - object
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)		; x is at location
	(at-unit ?p - patient ?u - unit) 		; patient is at unit
	(connected ?l1 - location ?l2 - location) ; locations are connected

	; (unloaded ?r - robot-box)               	; robot is empty
	(full ?b - box)
	(filled-with ?b - box ?c - content) 		; box is filled with content 
	
	(unit-has-box ?u - unit ?b - box)              ; unit has a box
	(unit-has-content ?u - unit ?c - content) ; unit has specific content

	(rob-carrier ?r - robot-box ?cr - carrier)          ; robot has a carrier
	(loaded ?cr - carrier ?b - box)          ; carrier is carrying a box
	(capacity ?cr - carrier ?n - capacity_number)
	(capacity_predecessor ?arg0 - capacity_number ?arg1 - capacity_number)


	(with-patient ?r - robot ?p - patient)     	; robot is with a patient
	(busy ?r - robot-patient)              		; robot is busy with a patient
)


; Both robot-box and robot-patient can move between connected locations
(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
		(not (= ?to central_warehouse))		; !!ROBOT-PATIENT CANNOT MOVE TO CENTRAL WAREHOUSE
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		; carrier is linked to robot
		; (forall (?c - carrier) 
		; 	(when (rob-carrier ?r ?c) 
		; 		(and 
		; 			(at ?c ?to)
		; 			(not (at ?c ?from))
		; 		)
		; 	)
		; )
		
		; patient is linked to robot
		; (forall (?p - patient) 
		; 	(when (with-patient ?r ?p) 
		; 		(and (at ?p ?to)
		; 			(not (at ?p ?from))
		; 		)
		; 	)
		; )
	)
)

(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(not (full ?b))
		(= ?l central_warehouse) ; content can only be filled in the central warehouse
	)
	:effect (and 
		(filled-with ?b ?c)
		(full ?b)
	)
)


; Robot-box can pick up a box from a location
(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location ?cr - carrier ?s1 - capacity_number ?s2 - capacity_number)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)

		(rob-carrier ?r ?cr)
		(capacity_predecessor ?s1 ?s2)
		(capacity ?cr ?s2)
	)
	:effect (and 
		(loaded ?cr ?b)
		(not (at ?b ?l))
		
		(capacity ?cr ?s1)
		(not (capacity ?cr ?s2))
	)
)



(:action drop
	:parameters (?r - robot-box ?b - box ?l - location ?u - unit ?cr - carrier ?s1 - capacity_number ?s2 - capacity_number)
	:precondition (and
		(at ?r ?l)
		(at ?u ?l)

		(rob-carrier ?r ?cr)
		(loaded ?cr ?b)

		(capacity_predecessor ?s1 ?s2)
		(capacity ?cr ?s1)
	)
	:effect (and 
		(unit-has-box ?u ?b)
		(at ?b ?l)

		(not (loaded ?cr ?b))
		(capacity ?cr ?s2)
		(not (capacity ?cr ?s1))
	)
)


; Robot-box can empty a box filled with content causing the unit to have that content
(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(not (full ?b))
		(at ?c ?l)
	)
)


(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)

(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?u ?l)
		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(at ?p ?l)
		(at-unit ?p ?u)
		
		(not (with-patient ?r ?p))
		(not (busy ?r))
	)
)

(:action return-to-warehouse
	:parameters (?r - robot-box ?from - location ?cr - carrier ?s - capacity_number)
	:precondition (and 
		(at ?r ?from)

		(rob-carrier ?r ?cr)
		(not (exists (?s0 - capacity_number) (capacity_predecessor ?s0 ?s)))
		(or (connected ?from central_warehouse) (connected central_warehouse ?from))
		(not (at ?r central_warehouse))
	)
	:effect (and 
		(at ?r central_warehouse)
		(not (at ?r ?from))
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 - box

    u1 u2 u3 - unit
    l1 l2 - location

    p1 - patient

    scalpel tongue_depressor aspirin bandage thermometer - content

    c1 - carrier

    capacity_0 - capacity_number
	capacity_1 - capacity_number
    capacity_2 - capacity_number
    capacity_3 - capacity_number
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)

    (at tongue_depressor central_warehouse)
    (at scalpel central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l2)

    (at r1 central_warehouse)
    (at r2 entrance)

    (at p1 entrance)
    
    (connected entrance l1)
    (connected l1 l2)
    (connected l2 central_warehouse)

    (rob-carrier r1 c1)
    (capacity_predecessor capacity_0 capacity_1)
    (capacity_predecessor capacity_1 capacity_2)
    (capacity_predecessor capacity_2 capacity_3)
    (capacity c1 capacity_2)
)

(:goal (and
    (unit-has-content u1 scalpel)
    (unit-has-content u2 scalpel)
    (unit-has-content u2 tongue_depressor)

    (at-unit p1 u1)
))

)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 4
2. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 0 of 4
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at p1 l1) (at-unit p1 u1)
   goals met: 1 of 4
4. (fill r1 b3 scalpel central_warehouse)
   added: (filled-with b3 scalpel) (full b3)
   goals met: 1 of 4
5. (fill r1 b2 tongue_depressor central_warehouse)
   added: (filled-with b2 tongue_depressor) (full b2)
   goals met: 1 of 4
6. (pick-up r1 b2 central_warehouse c1 capacity_1 capacity_2)
   deleted: (at b2 central_warehouse) (capacity c1 capacity_2)
   added: (loaded c1 b2) (capacity c1 capacity_1)
   goals met: 1 of 4
7. (pick-up r1 b3 central_warehouse c1 capacity_0 capacity_1)
   deleted: (at b3 central_warehouse) (capacity c1 capacity_1)
   added: (loaded c1 b3) (capacity c1 capacity_0)
   goals met: 1 of 4
8. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 1 of 4
9. (drop r1 b2 l2 u2 c1 capacity_0 capacity_1)
   deleted: (loaded c1 b2) (capacity c1 capacity_0)
   added: (unit-has-box u2 b2) (at b2 l2) (capacity c1 capacity_1)
   goals met: 1 of 4
10. (empty r1 b2 tongue_depressor u2 l2)
   deleted: (filled-with b2 tongue_depressor) (full b2)
   added: (unit-has-content u2 tongue_depressor) (at tongue_depressor l2)
   goals met: 2 of 4
11. (drop r1 b3 l2 u2 c1 capacity_1 capacity_2)
   deleted: (loaded c1 b3) (capacity c1 capacity_1)
   added: (unit-has-box u2 b3) (at b3 l2) (capacity c1 capacity_2)
   goals met: 2 of 4
12. (empty r1 b3 scalpel u2 l2)
   deleted: (filled-with b3 scalpel) (full b3)
   added: (unit-has-content u2 scalpel) (at scalpel l2)
   goals met: 3 of 4
13. (return-to-warehouse r1 l2 c1 capacity_0)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 3 of 4
14. (fill r1 b1 scalpel central_warehouse)
   added: (filled-with b1 scalpel) (full b1)
   goals met: 3 of 4
15. (pick-up r1 b1 central_warehouse c1 capacity_1 capacity_2)
   deleted: (at b1 central_warehouse) (capacity c1 capacity_2)
   added: (loaded c1 b1) (capacity c1 capacity_1)
   goals met: 3 of 4
16. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 3 of 4
17. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 3 of 4
18. (drop r1 b1 l1 u1 c1 capacity_1 capacity_2)
   deleted: (loaded c1 b1) (capacity c1 capacity_1)
   added: (unit-has-box u1 b1) (at b1 l1) (capacity c1 capacity_2)
   goals met: 3 of 4
19. (empty r1 b1 scalpel u1 l1)
   deleted: (filled-with b1 scalpel) (full b1)
   added: (unit-has-content u1 scalpel) (at scalpel l1)
   goals met: 4 of 4
